In [1]:
import numpy as np
import pandas as pd

In [3]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -1.713801 -1.363456  1.890023 -0.308238
2013-01-02 -1.187425  1.085798 -0.078735  0.074067
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770
2013-01-04 -1.531428 -0.207911  0.078672 -0.572996
2013-01-05  1.322028  1.148008  0.337944  1.120134
2013-01-06 -0.442394  1.211472  0.148111 -0.289859

In [6]:
df2 = pd.DataFrame({'A':1,
                   'B': pd.Timestamp('20130102'),
                   'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                   'D': np.array([3]*4, dtype='int32'),
                   'E': pd.Categorical(['test','train','test','train']),
                   'F': 'foo'})
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [11]:
df2.head()

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [12]:
df2.tail()

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [13]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [14]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [15]:
df2.B

0   2013-01-02
1   2013-01-02
2   2013-01-02
3   2013-01-02
Name: B, dtype: datetime64[ns]

In [18]:
df2.to_numpy()

AttributeError: 'DataFrame' object has no attribute 'to_numpy'

In [19]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [20]:
df

                   A         B         C         D
2013-01-01 -1.713801 -1.363456  1.890023 -0.308238
2013-01-02 -1.187425  1.085798 -0.078735  0.074067
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770
2013-01-04 -1.531428 -0.207911  0.078672 -0.572996
2013-01-05  1.322028  1.148008  0.337944  1.120134
2013-01-06 -0.442394  1.211472  0.148111 -0.289859

In [25]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -1.713801   -1.187425    1.384915   -1.531428    1.322028   -0.442394
B   -1.363456    1.085798   -0.400561   -0.207911    1.148008    1.211472
C    1.890023   -0.078735   -0.062186    0.078672    0.337944    0.148111
D   -0.308238    0.074067   -2.035770   -0.572996    1.120134   -0.289859

In [26]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.308238  1.890023 -1.363456 -1.713801
2013-01-02  0.074067 -0.078735  1.085798 -1.187425
2013-01-03 -2.035770 -0.062186 -0.400561  1.384915
2013-01-04 -0.572996  0.078672 -0.207911 -1.531428
2013-01-05  1.120134  0.337944  1.148008  1.322028
2013-01-06 -0.289859  0.148111  1.211472 -0.442394

In [27]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-01 -1.713801 -1.363456  1.890023 -0.308238
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770
2013-01-04 -1.531428 -0.207911  0.078672 -0.572996
2013-01-02 -1.187425  1.085798 -0.078735  0.074067
2013-01-05  1.322028  1.148008  0.337944  1.120134
2013-01-06 -0.442394  1.211472  0.148111 -0.289859

In [28]:
df.A

2013-01-01   -1.713801
2013-01-02   -1.187425
2013-01-03    1.384915
2013-01-04   -1.531428
2013-01-05    1.322028
2013-01-06   -0.442394
Freq: D, Name: A, dtype: float64

In [29]:
df['A']

2013-01-01   -1.713801
2013-01-02   -1.187425
2013-01-03    1.384915
2013-01-04   -1.531428
2013-01-05    1.322028
2013-01-06   -0.442394
Freq: D, Name: A, dtype: float64

In [30]:
df[0:3]

                   A         B         C         D
2013-01-01 -1.713801 -1.363456  1.890023 -0.308238
2013-01-02 -1.187425  1.085798 -0.078735  0.074067
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770

In [31]:
df.loc[dates[0]]

A   -1.713801
B   -1.363456
C    1.890023
D   -0.308238
Name: 2013-01-01 00:00:00, dtype: float64

In [32]:
df.loc[:, ['A','B']]

                   A         B
2013-01-01 -1.713801 -1.363456
2013-01-02 -1.187425  1.085798
2013-01-03  1.384915 -0.400561
2013-01-04 -1.531428 -0.207911
2013-01-05  1.322028  1.148008
2013-01-06 -0.442394  1.211472

In [33]:
df.loc['20130102':'20130104', ['A','B']]

                   A         B
2013-01-02 -1.187425  1.085798
2013-01-03  1.384915 -0.400561
2013-01-04 -1.531428 -0.207911

In [34]:
df.loc['20130102',['A','B']]

A   -1.187425
B    1.085798
Name: 2013-01-02 00:00:00, dtype: float64

In [35]:
df.loc[dates[0],'A']

-1.713800860743133

In [36]:
df.at[dates[0],'A']

-1.713800860743133

In [37]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.531428 -0.207911
2013-01-05  1.322028  1.148008

In [38]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02 -1.187425 -0.078735
2013-01-03  1.384915 -0.062186
2013-01-05  1.322028  0.337944

In [39]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02 -1.187425  1.085798 -0.078735  0.074067
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770

In [40]:
df.iloc[1,1]

1.0857984852148874

In [42]:
df.iat[1,1]

1.0857984852148874

In [43]:
df[df.A>0]

                   A         B         C         D
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770
2013-01-05  1.322028  1.148008  0.337944  1.120134

In [44]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN       NaN  1.890023       NaN
2013-01-02       NaN  1.085798       NaN  0.074067
2013-01-03  1.384915       NaN       NaN       NaN
2013-01-04       NaN       NaN  0.078672       NaN
2013-01-05  1.322028  1.148008  0.337944  1.120134
2013-01-06       NaN  1.211472  0.148111       NaN

In [46]:
df3 = df.copy()
df3

                   A         B         C         D
2013-01-01 -1.713801 -1.363456  1.890023 -0.308238
2013-01-02 -1.187425  1.085798 -0.078735  0.074067
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770
2013-01-04 -1.531428 -0.207911  0.078672 -0.572996
2013-01-05  1.322028  1.148008  0.337944  1.120134
2013-01-06 -0.442394  1.211472  0.148111 -0.289859

In [47]:
df3['E']=['a','b','c','d','e','f']
df3

                   A         B         C         D  E
2013-01-01 -1.713801 -1.363456  1.890023 -0.308238  a
2013-01-02 -1.187425  1.085798 -0.078735  0.074067  b
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770  c
2013-01-04 -1.531428 -0.207911  0.078672 -0.572996  d
2013-01-05  1.322028  1.148008  0.337944  1.120134  e
2013-01-06 -0.442394  1.211472  0.148111 -0.289859  f

In [48]:
df3[df3['E'].isin(['d','e'])]

                   A         B         C         D  E
2013-01-04 -1.531428 -0.207911  0.078672 -0.572996  d
2013-01-05  1.322028  1.148008  0.337944  1.120134  e

In [50]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [52]:
df4= df.copy()
df4[df4  >0]= -df4
df4

                   A         B         C         D
2013-01-01 -1.713801 -1.363456 -1.890023 -0.308238
2013-01-02 -1.187425 -1.085798 -0.078735 -0.074067
2013-01-03 -1.384915 -0.400561 -0.062186 -2.035770
2013-01-04 -1.531428 -0.207911 -0.078672 -0.572996
2013-01-05 -1.322028 -1.148008 -0.337944 -1.120134
2013-01-06 -0.442394 -1.211472 -0.148111 -0.289859

In [54]:
df

                   A         B         C         D
2013-01-01 -1.713801 -1.363456  1.890023 -0.308238
2013-01-02 -1.187425  1.085798 -0.078735  0.074067
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770
2013-01-04 -1.531428 -0.207911  0.078672 -0.572996
2013-01-05  1.322028  1.148008  0.337944  1.120134
2013-01-06 -0.442394  1.211472  0.148111 -0.289859

In [55]:
df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])
df.loc[dates[0]:dates[1], 'E'] = 1
df

                   A         B         C         D    E
2013-01-01 -1.713801 -1.363456  1.890023 -0.308238  1.0
2013-01-02 -1.187425  1.085798 -0.078735  0.074067  1.0
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770  NaN
2013-01-04 -1.531428 -0.207911  0.078672 -0.572996  NaN
2013-01-05  1.322028  1.148008  0.337944  1.120134  NaN
2013-01-06 -0.442394  1.211472  0.148111 -0.289859  NaN

In [56]:
df.dropna(how='any')

                   A         B         C         D    E
2013-01-01 -1.713801 -1.363456  1.890023 -0.308238  1.0
2013-01-02 -1.187425  1.085798 -0.078735  0.074067  1.0

In [58]:
df.fillna(value=5)

                   A         B         C         D    E
2013-01-01 -1.713801 -1.363456  1.890023 -0.308238  1.0
2013-01-02 -1.187425  1.085798 -0.078735  0.074067  1.0
2013-01-03  1.384915 -0.400561 -0.062186 -2.035770  5.0
2013-01-04 -1.531428 -0.207911  0.078672 -0.572996  5.0
2013-01-05  1.322028  1.148008  0.337944  1.120134  5.0
2013-01-06 -0.442394  1.211472  0.148111 -0.289859  5.0

In [59]:
pd.isna(df)

                A      B      C      D      E
2013-01-01  False  False  False  False  False
2013-01-02  False  False  False  False  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False  False  False   True
2013-01-05  False  False  False  False   True
2013-01-06  False  False  False  False   True

In [60]:
df.mean()

A   -0.361351
B    0.245558
C    0.385638
D   -0.335444
E    1.000000
dtype: float64

In [61]:
df.mean(1)

2013-01-01   -0.099094
2013-01-02    0.178741
2013-01-03   -0.278401
2013-01-04   -0.558416
2013-01-05    0.982028
2013-01-06    0.156833
Freq: D, dtype: float64

In [63]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [64]:
df.sub(s, axis='index')

                   A         B         C         D   E
2013-01-01       NaN       NaN       NaN       NaN NaN
2013-01-02       NaN       NaN       NaN       NaN NaN
2013-01-03  0.384915 -1.400561 -1.062186 -3.035770 NaN
2013-01-04 -4.531428 -3.207911 -2.921328 -3.572996 NaN
2013-01-05 -3.677972 -3.851992 -4.662056 -3.879866 NaN
2013-01-06       NaN       NaN       NaN       NaN NaN

In [65]:
# 申请